html/apue/stdio.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>标准IO</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="standard.html"> UP </a>
 |
 <a accesskey="H" href="apue.html"> HOME </a>
</div><div id="content">
<h1 class="title">标准IO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">标准I/O</a>
<ul>
<li><a href="#sec-1-1">流和FILE对象</a></li>
<li><a href="#sec-1-2">标准输入、标准输出和标准出错</a></li>
<li><a href="#sec-1-3">缓存</a>
<ul>
<li><a href="#sec-1-3-1">全缓存</a></li>
<li><a href="#sec-1-3-2">行缓存</a></li>
<li><a href="#sec-1-3-3">不带缓存</a></li>
<li><a href="#sec-1-3-4">默认实现</a></li>
<li><a href="#sec-1-3-5">setbuf和setvbuf函数</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
本章说明标准I/O库。因为不仅在UNIX而且在很多操作系统上都实现此库，所以它由ANSIC标准说明。标准I/O库处理很多细节，例如缓存分配，以优化长度执行I/O等。标准I/O库是在系统调用函数基础上构造的 
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">标准I/O</h2>
<div class="outline-text-2" id="text-1">
<p>
在第3章中所有I/O函数都是针对文件描述符的。当打开一个文件时，即返回一个文件描述符，然后该文件描述符就用于后读的I/O操作
</p>

<p>
对于标准I/O库，它们的操作则是围绕流(stream)进行的。当用标准I/O库打开或创建一个文件时我们已使一个流与一个文件相结合。当打开一个流时，标准I/O函数fopen返回一个指向FILE对象的指针
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">流和FILE对象</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>FILE对象: 通常是一个结构，包含了I/O库为管理该流所需要的所有信息，比如用于实际I/O的文件描述符，指向流缓存的指针，缓存的长度，当前在缓存中的字符数，出错标志等等
</li>
<li>文件指针：指向FILE对象的指针(类型为FILE*)　
</li>
</ul>

<p>
为了引用一个流，需将文件指针作为参数传递给每个标准I/O函数
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">标准输入、标准输出和标准出错</h3>
<div class="outline-text-3" id="text-1-2">
<p>
对一个进程预定义了三个流，它们自动地可为进程使用：标准输入、标准输出和标准出错。在3.2节中曾用文件描述符STDIN_FILENO，STDOUT_FILENO和STDERR_FILENO分别表示它们
</p>

<p>
这三个标准I/O流通过预定义文件指针stdin，stdout和stderr加以引用。这三个文件指针同样定义在头文件&lt;stdio.h&gt;中
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">缓存</h3>
<div class="outline-text-3" id="text-1-3">
<p>
标准I/O提供缓存的目的是尽可能减少使用read和write调用的数量。它也对每个I/O流自动地进行缓存管理，简化了应用程序的实现
</p>

<p>
在一个流上执行第一次I/O操作时，相关标准I/O函数通常调用malloc获得需要的缓存
</p>

<p>
刷新(flush)：标准I/O缓存的写操作。缓存可由标准I/O例程自动地刷新(例如当填满一个缓存时)，或者可以调用函数fflush刷新一个流 
</p>

<p>
标准I/O提供了三种类型的缓存: 全缓存，行缓存，无缓存
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">全缓存</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
当填满标准I/O缓存后才进行实际I/O操作
</p>

<p>
对于驻在磁盘上的文件通常是由标准I/O库实施全缓存的
</p>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">行缓存</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
当在输入和输出中遇到新行符时，标准I/O库执行I/O操作。这允许我们一次输出一个字符(用标准I/Ofputc函数)，但只有在写了一行之后才进行实际I/O操作
</p>

<p>
当流涉及一个终端时(例如标准输入和标准输出)，典型地使用行缓存
</p>

<p>
对于行缓存有两个限制：
</p>
<ol class="org-ol">
<li>因为标准I/O库用来收集每一行的缓存的长度是固定的，所以只要填满了缓存，那么即使还没有写一个新行符，也进行I/O操作
</li>
<li>任何时候只要通过标准输入输出库要求从以下两种情况得到数据就会造成刷新所有行缓存输出流
<ul class="org-ul">
<li>一个不带缓存的流：从不带缓存的一个流中进行输入要求只能从内核得到数据
</li>
<li>一个行缓存的流(它预先要求从内核得到数据)：所需的数据可能已在该缓存中，但并不要求内核在需要该数据时才进行该操作
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">不带缓存</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
标准I/O库不对字符进行缓存。如果用标准I/O函数写若干字符到不带缓存的流中，则相当于用write系统调用函数将这些字符写至相关联的打开文件上。
</p>

<p>
标准出错流stderr通常是不带缓存的，这就使得出错信息可以尽快显示出来，而不管它们是否含有一个新行字符
</p>
</div>
</div>

<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4">默认实现</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
ANSIC要求下列缓存特征:
</p>
<ol class="org-ol">
<li>当且仅当标准输入和标准输出并不涉及交互作用设备时，它们才是全缓存的
</li>
<li>标准出错决不会是全缓存的 
</li>
</ol>

<p>
UNIX系统默认使用下列类型的缓存:
</p>
<ol class="org-ol">
<li>标准出错是不带缓存的 
</li>
<li>如若是涉及终端设备的其他流，则它们是行缓存的，否则是全缓存的
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5">setbuf和setvbuf函数</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
setbuf和setvbuf函数：设置文件流的缓存
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;stdio.h&gt;</span>

<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">   &#25171;&#24320;&#25110;&#20851;&#38381;&#25991;&#20214;&#27969;&#32531;&#23384;</span>

<span style="color: #ffa07a;">   fp&#65306;&#25991;&#20214;&#25351;&#38024;</span>
<span style="color: #ffa07a;">   buf&#65306;&#32531;&#23384;&#21306;&#25351;&#38024;&#65292;&#22914;&#26524;&#20026;NULL&#21017;&#20851;&#38381;&#32531;&#23384;&#65292;&#21453;&#20043;&#21017;&#25171;&#24320;&#32531;&#23384;</span>

<span style="color: #ffa07a;">   return&#65306;&#33509;&#25104;&#21151;&#21017;&#20026; 0,&#33509;&#20986;&#38169;&#21017;&#20026;&#38750;0</span>
<span style="color: #ffa07a;">*/</span>
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">setbuf</span>(<span style="color: #98fb98;">FILE</span>* <span style="color: #eedd82;">fp</span>, <span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">buf</span>);

<span style="color: #ffa07a;">/**</span>
<span style="color: #ffa07a;">   &#35774;&#32622;&#25991;&#20214;&#27969;&#30340;&#32531;&#23384;</span>

<span style="color: #ffa07a;">   fp&#65306;&#25991;&#20214;&#25351;&#38024;</span>
<span style="color: #ffa07a;">   buf&#65306;&#32531;&#23384;&#21306;&#25351;&#38024;</span>
<span style="color: #ffa07a;">   mode&#65306;&#32531;&#23384;&#31867;&#22411;&#65292;_IOFBF &#20840;&#32531;&#23384;&#65292;_IOLBF &#34892;&#32531;&#23384;, _IONBF &#19981;&#24102;&#32531;&#23384;</span>
<span style="color: #ffa07a;">   size&#65306;&#32531;&#23384;&#21306;&#22823;&#23567;</span>

<span style="color: #ffa07a;">   return&#65306;&#33509;&#25104;&#21151;&#21017;&#20026; 0,&#33509;&#20986;&#38169;&#21017;&#20026;&#38750;0   </span>
<span style="color: #ffa07a;">*/</span>
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">setvbuf</span>(<span style="color: #98fb98;">FILE</span>* <span style="color: #eedd82;">fp</span>, <span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">buf</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">mode</span>, <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">size</span>);
</pre>
</div>

<p>
setbuf和setvbuf参数说明
</p>

<!-- This HTML table template is generated by emacs 24.5.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;函数&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;mode&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;buf&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;缓存及长度&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;缓存类型&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td rowspan="2" align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;setbuf&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td rowspan="2" align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;nonnull&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      长度为BUFSIZE的用户缓存
    </td>
    <td align="left" valign="top">
      &nbsp;全缓存或行缓存&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;NULL&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;无缓存&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;　　无缓存&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td rowspan="5" align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;setvbuf&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td rowspan="2" align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;_IOFBF&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;nonnull&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;长度为size的用户缓存&nbsp;&nbsp;
    </td>
    <td rowspan="2" align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;全缓存&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;NULL&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;合适长度的系统缓存&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td rowspan="2" align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;_IOLBF&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;nonnull&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;长度为size的用户缓存&nbsp;&nbsp;
    </td>
    <td rowspan="2" align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;行缓存&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;NULL&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;合适长度的系统缓存&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;_IONBF&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;忽略&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;无缓存&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;无缓存&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

     <br/>
    <div class='ds-thread'></div>
<script>
var duoshuoQuery = {short_name:'klose911'};
(function() {
	 var dsThread = document.getElementsByClassName('ds-thread')[0];
         dsThread.setAttribute('data-thread-key', document.title);
         dsThread.setAttribute('data-title', document.title);
         dsThread.setAttribute('data-url', window.location.href);
	 var ds = document.createElement('script');
	 ds.type = 'text/javascript';ds.async = true;
	 ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	 ds.charset = 'UTF-8';
	 (document.getElementsByTagName('head')[0] 
				       || document.getElementsByTagName('body')[0]).appendChild(ds);
				       })();
</script>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-90850421-1', 'auto');
  ga('send', 'pageview');
</script>
</div>
</body>
</html>
